КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул1/КонтурЛогистика_ПЛ_Титул1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЛ_Титул1</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПЛ</name>
    <comment>(из пула!) Выдается ГИС ЭПД Уникальный идентификатор документа путевого листа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфСоб</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфСоб</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоОформившееПЛ</name>
    <comment>Сведения о лице, оформившем путевой лист</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <comment>Юр лицо, предоставляющее груз к перевозке, отправитель докуметна(Титула) в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПЛ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСменаВодителя</name>
    <comment>ПризнНачРейс Принимает значение:1 – выезд с парковки (парковочного места) 2 – прием-сдача транспортного средства последующим водителем по окончании рабочего дня (смены) предыдущего водителя (в случае оформления или формирования нескольких путевых листо</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийПЛ</name>
    <comment>только если ЭтоСменаВодителя</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязМедосмотрПосле</name>
    <comment>Признак обязательности проведения послесменного, послерейсового медицинского осмотра</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКоммерческойПеревозки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОтправления</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПЛ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПЛИнтервал</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель2</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <comment>Транспортное средство на котором начинает исполняться перевозки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <comment>Обязателен если тип основного транспортного средства - тягач</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп2</name>
    <comment>Второй прицеп автопоезда</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>для себя, не отправим в документе</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияМедик</name>
    <comment>пусто >> равен ЛицоОформившееПЛ</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияТехСостояние</name>
    <comment>пусто >> равен ЛицоОформившееПЛ</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияОдометр</name>
    <comment>пусто >> равен ЛицоОформившееПЛ</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаQRКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <comment>признак отказа в подписи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <comment>текст содержащий причину отказа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьТ2Сразу</name>
    <comment>Если требуется создать и подписать сразу титул 2, то необходимо заполнить реквизиты с префиксом &quot;ДанныеТ2&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2МедРаботник</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2МедЛицензия</name>
    <comment>Лицензия на осущ. мед. деятельности</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2ДатВрПрМО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьТ3Сразу</name>
    <comment>Если требуется создать и подписать сразу титул 2, то необходимо заполнить реквизиты с префиксом &quot;ДанныеТ3&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ТехРаботник</name>
    <comment>Сведения о должностном лице, ответственном за техническое состояние и безопасную эксплуатацию транспортного средства</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ДатВрКонтТехСост</name>
    <comment>Дата и время контроля технического состояния</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ДатВрВыпНаЛин</name>
    <comment>Дата и время выпуска транспортного средства на линию</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьТ4Сразу</name>
    <comment>Если требуется создать и подписать сразу титул 2, то необходимо заполнить реквизиты с префиксом &quot;ДанныеТ4&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ4ОдометрРаботник</name>
    <comment>Сведения о лице, уполномоченном на проставление данных при выезде транспортного средства с парковки (парковочного места)/при приеме транспортного средства</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ4Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ4ПоказанияОдометра</name>
    <comment>Показания одометра</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ4ДатВрОдометр</name>
    <comment>Дата и время снятия показаний одометра</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ4ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ4ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыЕГАИС</name>
    <comment>Список идентификаторов ЕГАИС с разделителем ;</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>DefinedType.КонтурЛогистика_РазделительДокументаУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерМедик</name>
    <comment>надсущность над контрагентами, например, ТС Магнит или ТК Монополия</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеГрузоотправители</name>
    <attributes>
      <name>Грузоотправитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВодители</name>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаПунктов</name>
    <attributes>
      <name>ПунктМаршрута</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыПеревозки/КонтурЛогистика_ВидыПеревозки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВидыПеревозки</name>
  <enumValues>
    <name>КП</name>
  </enumValues>
  <enumValues>
    <name>СН</name>
  </enumValues>
  <enumValues>
    <name>СТ</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул1/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Страницы.Видимость = Ложь;
	ОбновитьДанныеФормы();

	СвязанныеДокументыТитулы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);

	РазблокироватьДанныеФормыДляРедактирования();

	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
	// Отказ медосмотр или техника
	Элементы.ГруппаСоздатьНовый.Видимость = (ЗначениеЗаполнено(Объект.Ссылка)
		И ТребуетсяПереотправить(ТекущийКодСостоянияДокументооборота));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// баги старой платформы при отрисовке сложных группировок:
	// в режиме интерфейса 8.2 отображаем в режиме "на отдельных закладках" шапку и тч
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда
		ШапкаНаОтдельнойЗакладке = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШапка;
	КонецЕсли;
	
	Элементы.ДанныеТ2ПараметрНастроекПодписания.Видимость = Ложь;
	Элементы.ДанныеТ3ПараметрНастроекПодписания.Видимость = Ложь;
	Элементы.ДанныеТ4ПараметрНастроекПодписания.Видимость = Ложь;
	
	ПроверитьДокумент();
	
	ВывестиВидВладенияТС();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийКодСостоянияДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка).Код;
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка
		Или ТребуетсяПереотправить(ТекущийКодСостоянияДокументооборота) 
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки Тогда
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;

	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	
	// TODO
	//ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	//Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;

	//Элементы.ПерезаполнитьПоДокОснованию.Видимость = Не ЭтоВходящий И ЕстьДокУчСист;
	//Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = Не ЕстьДокУчСист;
	Элементы.ПользовательПодписант.Видимость = Не ЭтоВходящий;

	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка,
																				   Объект.ДокументОснование,
																				   Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию,
																				   ТекущийСтатус);
	
	Если ТребуетсяПереотправить(ТекущийКодСостоянияДокументооборота) Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Сформировать новый";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Картинка = БиблиотекаКартинок.СкопироватьОбъект;
	КонецЕсли;
	
	Если Переотправлен(ТекущийКодСостоянияДокументооборота) Или ТребуетсяПереотправить(ТекущийКодСостоянияДокументооборота) Тогда
		ПричинаОтказаВПодписиТехКонтроля = ПричинаОтказаВПодписиТехКонтроляИзТитула3(Объект.Ссылка);
	КонецЕсли;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1, Объект.ДокументОснование);
	
	Элементы.ОткрытьНастройкуКонвертации.Видимость = КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации;
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияМедик) Тогда
		ОрганизацияМедикНаш = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.ОрганизацияМедик, "Наш");
	Иначе
		ОрганизацияМедикНаш = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияТехСостояние) Тогда
		ОрганизацияТехСостояниеНаш = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.ОрганизацияТехСостояние, "Наш");
	Иначе
		ОрганизацияТехСостояниеНаш = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияОдометр) Тогда
		ОрганизацияОдометрНаш = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.ОрганизацияОдометр, "Наш");
	Иначе
		ОрганизацияОдометрНаш = Ложь;
	КонецЕсли;
	
	ОтрисоватьДокументыОснованияСервер();
	
	ДополнитьЗаголовокПоказатьДопПоля();
	
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы.Видимость = СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса()

	СтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);

	Если СтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		 Или СтатусТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке")
		 Или СтатусТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена")
		 Или СтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда

		ТолькоПросмотр = Макс(Ложь, ТолькоПросмотр);
		
	Иначе

		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда 
		Элементы.ПерезаполнитьПоДокОснованию.Видимость = Ложь;
		Элементы.ПодменюУправление.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаФормироватьТ2СразуФлажек.Доступность = Не ТолькоПросмотр;
	Элементы.ГруппаСквознойСценарийТехКонтрольФлажек.Доступность = Не ТолькоПросмотр;
	Элементы.УстановитьДатуВремяТекущимТ2.Видимость = Не ТолькоПросмотр;
	Элементы.УстановитьДатуВремяТекущимТ31.Видимость = Не ТолькоПросмотр;
	Элементы.УстановитьДатуВремяТекущимТ32.Видимость = Не ТолькоПросмотр;
	Элементы.УстановитьДатуВремяТекущимТ4.Видимость = Не ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)

	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	Перепроверить();

КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)

	ОбработчикПеречитатьОбъект();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбработчикПеречитатьОбъектСервер();
	
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикПеречитатьОбъектСервер()

	ОбновитьДанныеФормы();
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	УправлениеКолбасойТитуловВызовСервера();

КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("КонтурЛогистика_ВвестиДокумент");
КонецПроцедуры

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	ЗаполнитьПредставлениеРеквизитовДокументаОснования();

	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
	УправлениеВидимостьюИДоступностью(); 	// доступность команд
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Процедура РассчитатьПартнераМедика()

	Если ЗначениеЗаполнено(Объект.ОрганизацияМедик) Тогда 
		Объект.ПартнерМедик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Объект.ОрганизацияМедик);
	Иначе
		Объект.ПартнерМедик = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьДокументСервер()

	ДокОбъект = РеквизитФормыВЗначение("Объект");

	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ПЛ_Титул1.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);

	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);

	Возврат РезультатПроверки;

КонецФункции

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)

	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1"),
																		  Объект.ДокументОснование);

КонецПроцедуры

// Управление положением подробных сведений о товаре

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	// реализуем отдельную обработку некоторых требуемых действий
	Если Ложь Тогда // Какие-то особенные UI для требуемых действий, например: ТребуемоеДействие = "Исправить GTIN" Тогда

	Иначе // типовая обработка таблицы ошибок

		Если ПолеТаблицыОшибок <> Неопределено Тогда
			КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// УПРАВЛЕНИЕ ВИДИМОСТЬЮ И ДОСТУПНОСТЬЮ
&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()

	УстановитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	// зависимости от формата ПЛ
	Элементы.ПредыдущийПЛ.Видимость = Объект.ЭтоСменаВодителя;
	
	ЭтоКоммерческаяПеревозка = Объект.ВидПеревозки = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВидыПеревозки.КП");
	
	Элементы.ВидКоммерческойПеревозки.Видимость = ЭтоКоммерческаяПеревозка;
	
	ЭтоПеревозкаПоДоговору = Объект.ВидКоммерческойПеревозки = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВидыКоммерческихПеревозок.ПГ");
	Элементы.ГруппаМестоОтправления.Видимость = ЭтоКоммерческаяПеревозка И ЭтоПеревозкаПоДоговору;
	Элементы.ГруппаПунктыМаршрута.Видимость = ЭтоКоммерческаяПеревозка И ЭтоПеревозкаПоДоговору;
	
	// Причина отказа в подписи
	Элементы.ГруппаПричинаОтказаВПодписи.Видимость = Объект.ЕстьОтказВПодписи;
	Элементы.ГруппаПричинаОтказаВПодписиТехника.Видимость = ЗначениеЗаполнено(ПричинаОтказаВПодписиТехКонтроля);
	
	СкрытьПоказатьЗначенияДокУчСист();
	
	Если Не ЗначениеЗаполнено(Объект.ОрганизацияМедик) 
		И Не ЗначениеЗаполнено(Объект.ОрганизацияТехСостояние)
		И Не ЗначениеЗаполнено(Объект.ОрганизацияОдометр)
		Тогда 
		СкрытьДопСтороны = Истина;
	Иначе
		СкрытьДопСтороны = Ложь;
	КонецЕсли;
	Элементы.ГруппаДопСтороны.Видимость = Не СкрытьДопСтороны;
	Элементы.ГруппаВключитьВидимостьСторон.Видимость = Не Элементы.ГруппаДопСтороны.Видимость;
	
	Если Не ИдетВыборВодителя2 Тогда
		Элементы.ГруппаВодитель2.Видимость = ЗначениеЗаполнено(Объект.Водитель2);
		Элементы.КартинкаВодительПлюс1.Видимость = Не Элементы.ГруппаВодитель2.Видимость;
	КонецЕсли;
	
	Элементы.ГруппаПрицеп2.Видимость = ЗначениеЗаполнено(Объект.Прицеп2);
	Элементы.КартинкаПрицепПлюс1.Видимость = Не Элементы.ГруппаПрицеп2.Видимость;
	
	Элементы.СрокПЛИнтервал.Видимость = ЗначениеЗаполнено(Объект.СрокПЛИнтервал);
	Элементы.СрокПЛ.Заголовок = ?(ЗначениеЗаполнено(Объект.СрокПЛИнтервал), "С","День");
	Элементы.ГруппаСрокИнтервал.Видимость = Не Элементы.СрокПЛИнтервал.Видимость;
	
	Элементы.РазделительИндикатор.Видимость = ЗначениеЗаполнено(Объект.Разделитель);
	Элементы.ПартнерМедик.Видимость = ЗначениеЗаполнено(Объект.ПартнерМедик);
	
	ОбновитьЭлементыСквозногоСценария();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)

	Элементы.ПерезаполнитьПоДокОснованию.ЦветТекста = Новый Цвет;
	
	ПерезаполнитьПоДокОснованиюСервер();
	ОбновитьДанныеФормы();

	ПолностьюОбновитьПредставлениеДанных();

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1, Объект.ДокументОснование);
	
	Если КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации
		Или КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация Тогда
				
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("ДокументОснование", ДокОбъект.ДокументОснование);
		ДанныеЗаполнения.Вставить("ТипЛогистика", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1);
		ДанныеЗаполнения.Вставить("Разделитель", ДокОбъект.Разделитель);
		ДанныеЗаполнения.Вставить("Перезаполнить", Истина);
		
		ДокОбъект.Заполнить(ДанныеЗаполнения);
		
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	
	Если Поле.Имя = "ТаблицаОшибокТекстОшибки" Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекущиеДанные.ТекстОшибки, "Полный текст проблемы");
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ИмяПоля = "ДанныеТ2Подписант"
		Или ТекущиеДанные.ИмяПоля = "ДанныеТ3Подписант"
		Или ТекущиеДанные.ИмяПоля = "ДанныеТ4Подписант" Тогда
		
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("ДатаГлавного", Объект.ДатаПЛ);
		ПараметрыРасчета.Вставить("ПользовательПодписант", Объект.ДанныеТ2ПользовательПодписант);
		ПараметрыРасчета.Вставить("ПараметрНастроекПодписания", Объект.ДанныеТ2ПараметрНастроекПодписания);
		
		Если ТекущиеДанные.ИмяПоля = "ДанныеТ2Подписант" Тогда
			ПараметрыРасчета.Вставить("ОрганизацияГлавного",
				?(ЗначениеЗаполнено(Объект.ОрганизацияМедик), Объект.ОрганизацияМедик, Объект.ЛицоОформившееПЛ));
		ИначеЕсли ТекущиеДанные.ИмяПоля = "ДанныеТ3Подписант" Тогда
			ПараметрыРасчета.Вставить("ОрганизацияГлавного",
				?(ЗначениеЗаполнено(Объект.ОрганизацияТехСостояние), Объект.ОрганизацияТехСостояние, Объект.ЛицоОформившееПЛ));
		ИначеЕсли ТекущиеДанные.ИмяПоля = "ДанныеТ4Подписант" Тогда
			ПараметрыРасчета.Вставить("ОрганизацияГлавного",
				?(ЗначениеЗаполнено(Объект.ОрганизацияОдометр), Объект.ОрганизацияОдометр, Объект.ЛицоОформившееПЛ));
		КонецЕсли;
		
		КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыборПодписанта(ЭтаФорма, Объект, ПараметрыРасчета);
		
	Иначе
		
		КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя, "ПослеВыбораВТаблицеОшибок");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформилПриИзменении(Элемент)
	
	ЗаполнитьЗначенияПоУмолчанию();
	
	ПроверитьДокумент();
	
	ВывестиВидВладенияТС();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицоОформившееПЛНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЛицоОформившееПЛДоИзменения = Объект.ЛицоОформившееПЛ;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПеревозчика = КонтурЛогистика_СтдОбщегоНазначения.ЗначенияРеквизитовОбъектаЛок(
		Объект.ЛицоОформившееПЛ, "ВидПеревозкиПоУмолчанию, ВидСообщенияПоУмолчанию, СрокДействияПоУмолчанию, ТехРаботникПоУмолчанию");
	
	Если ЗначениеЗаполнено(ЛицоОформившееПЛДоИзменения) Тогда
		РеквизитыПеревозчикаДоИзменения = КонтурЛогистика_СтдОбщегоНазначения.ЗначенияРеквизитовОбъектаЛок(
			ЛицоОформившееПЛДоИзменения, "ВидПеревозкиПоУмолчанию, ВидСообщенияПоУмолчанию, СрокДействияПоУмолчанию, ТехРаботникПоУмолчанию");
	Иначе
		РеквизитыПеревозчикаДоИзменения = Новый Структура("ВидПеревозкиПоУмолчанию, ВидСообщенияПоУмолчанию, СрокДействияПоУмолчанию, ТехРаботникПоУмолчанию");
	КонецЕсли;
	
	// ВидПеревозки
	Если (РеквизитыПеревозчикаДоИзменения.ВидПеревозкиПоУмолчанию = Объект.ВидПеревозки
			И ЗначениеЗаполнено(РеквизитыПеревозчика.ВидПеревозкиПоУмолчанию))
		Или Не ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
		
		Объект.ВидПеревозки = РеквизитыПеревозчика.ВидПеревозкиПоУмолчанию;
	КонецЕсли;
	
	// ВидСообщения
	Если (РеквизитыПеревозчикаДоИзменения.ВидСообщенияПоУмолчанию = Объект.ВидСообщения
			И ЗначениеЗаполнено(РеквизитыПеревозчика.ВидСообщенияПоУмолчанию))
		Или Не ЗначениеЗаполнено(Объект.ВидСообщения) Тогда
		
		Объект.ВидСообщения = РеквизитыПеревозчика.ВидСообщенияПоУмолчанию;
	КонецЕсли;
	
	// СрокПЛ
	Если Не ЗначениеЗаполнено(Объект.СрокПЛ)
		И ЗначениеЗаполнено(РеквизитыПеревозчика.СрокДействияПоУмолчанию) Тогда
		
		СекундВДне = 60 * 60 * 24;
		Объект.СрокПЛ = НачалоДня(ТекущаяДатаСеанса()) + СекундВДне * РеквизитыПеревозчика.СрокДействияПоУмолчанию;
		
	КонецЕсли;
	
	// ДанныеТ3ТехРаботник
	Если (РеквизитыПеревозчикаДоИзменения.ТехРаботникПоУмолчанию = Объект.ДанныеТ3ТехРаботник
			И ЗначениеЗаполнено(РеквизитыПеревозчика.ТехРаботникПоУмолчанию))
		Или Не ЗначениеЗаполнено(Объект.ДанныеТ3ТехРаботник) Тогда
		
		Объект.ДанныеТ3ТехРаботник = РеквизитыПеревозчика.ТехРаботникПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияМедикПриИзменении(Элемент)
	
	ОрганизацияМедикПриИзмененииСервер();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияМедикПриИзмененииСервер()

	Если ЗначениеЗаполнено(Объект.ОрганизацияМедик) Тогда
		ОрганизацияМедикНаш = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.ОрганизацияМедик, "Наш");
	Иначе
		ОрганизацияМедикНаш = Ложь;
	КонецЕсли;
	
	Если СтороннийМедикСервер() Тогда
		Объект.ФормироватьТ2Сразу = Ложь;
	КонецЕсли;
	РассчитатьПартнераМедика();	

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияТехСостояниеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияТехСостояние) Тогда
		ОрганизацияТехСостояниеНаш = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.ОрганизацияТехСостояние, "Наш");
	Иначе
		ОрганизацияТехСостояниеНаш = Ложь;
	КонецЕсли;
	
	Если СтороннийТехКонтроль() Тогда
		Объект.ФормироватьТ3Сразу = Ложь;
		Объект.ФормироватьТ4Сразу = Ложь;
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОдометрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияОдометр) Тогда
		ОрганизацияОдометрНаш = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.ОрганизацияОдометр, "Наш");
	Иначе
		ОрганизацияОдометрНаш = Ложь;
	КонецЕсли;
	
	Если СтороннийПоказанияОдометра() Тогда
		Объект.ФормироватьТ3Сразу = Ложь;
		Объект.ФормироватьТ4Сразу = Ложь;
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВидКоммерческойПеревозкиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВидСообщенияПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ЭтоСменаВодителяПриИзменении(Элемент)
	
	Если Объект.ЭтоСменаВодителя Тогда
		Объект.ФормироватьТ2Сразу = Ложь;
		Объект.ФормироватьТ3Сразу = Ложь;
		Объект.ФормироватьТ4Сразу = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийПЛПриИзменении(Элемент)
	
	ПерезаполнитьПоПредыдущемуПЛ();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоПредыдущемуПЛ()

	Если ЗначениеЗаполнено(Объект.ПредыдущийПЛ) Тогда

		Объект.ДополнительныеВодители.Очистить();
		Объект.ДополнительныеГрузоотправители.Очистить();
		Объект.АдресаПунктов.Очистить();
		Объект.ДополнительныеПолучателиФайла.Очистить();
		Объект.ИнфПол.Очистить();
		
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.Заполнить(Новый Структура("ДокументОснование, ТипЛогистика",
											ДокОбъект.ПредыдущийПЛ,
											Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1));
											
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		
		Модифицированность = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура Водитель2ПриИзменении(Элемент)
	
	ИдетВыборВодителя2 = Ложь;
	УправлениеКолбасойТитуловВызовСервера();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура Водитель2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИдетВыборВодителя2 = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоОтправленияПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СрокПЛИнтервалПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СрокПЛПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	
	ЗаполнитьПрицепПоУмолчанию();
	
	ПроверитьДокумент();
	
	ВывестиВидВладенияТС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрицепПоУмолчанию()
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Объект.Прицеп = Объект.ТранспортноеСредство.ПрицепПоУмолчанию;
		Объект.Прицеп2 = Объект.ТранспортноеСредство.Прицеп2ПоУмолчанию;
	Иначе
		Объект.Прицеп = Справочники.УчетнаяСистема_ТранспортныеСредства.ПустаяСсылка();
		Объект.Прицеп2 = Справочники.УчетнаяСистема_ТранспортныеСредства.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И (Параметр = Объект.Ссылка Или (Параметр <> Неопределено
																							И ТипЗнч(Параметр) = Тип("Массив")
																							И Параметр.Найти(Объект.Ссылка) <> Неопределено)) Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
			  И Параметр <> Неопределено
			  И ТипЗнч(Параметр) = Тип("Массив")
			  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда

		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов"
			  И Параметр <> Неопределено
			  И ТипЗнч(Параметр) = Тип("Массив")
			  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда

		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
				
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьТипВладения" Тогда

		ВывестиВидВладенияТС();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗначенияДокументаУчетнойСистемы(Команда)
	
	РеквизитыУчетногоДокументаВидимы = Не РеквизитыУчетногоДокументаВидимы;
	Если РеквизитыУчетногоДокументаВидимы Тогда 
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Скрыть;
	Иначе
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Показать;
	КонецЕсли;
	
	СкрытьПоказатьЗначенияДокУчСист();

КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьЗначенияДокУчСист()
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()
	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		
		Значение = Неопределено;
		ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
		ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
		ИмяЭлементаЗначениеИзДокУчСист = "ДокУчСист_" + Эл.Ключ;
		
		Если Представления.Свойство(Эл.Ключ, Значение) Тогда
			
			// Есть значение в реквизите ДокУчСист_ххх извлеченного из Документа учетной системы
			
			текВыражение = "ДокУчСист_" + Эл.Ключ + " = Значение";
			Выполнить (текВыражение);
			
			// определим доступность команды сопоставления
			
			Если ЗначениеЗаполнено(ИмяЭлементаЛогистика) Тогда
				
				ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
				
				РеквизитИзвлеченИзДокумента = ЗначениеЗаполнено(Этаформа[ИмяЭлементаЗначениеИзДокУчСист]);
				
				Если РеквизитИзвлеченИзДокумента Тогда // если этот элемент выведен на форму и он рассчитан из документа уч сист
					
					Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
						
						ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
						НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
						
					Иначе
						
						НужноСопоставить = Ложь;
						
					КонецЕсли;
					
					Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Не НужноСопоставить;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = НужноСопоставить ИЛИ РеквизитыУчетногоДокументаВидимы;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Заголовок = "Сопоставить";
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Установить новое соответствие";
					
				Иначе // не извлечен из документа Уч сист
					
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = Ложь;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = Ложь;
					
					Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
						
						Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Не извлечен или не заполнен в док. основании. Открыть исходный документ";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость 	= Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)
	
	ИменаРеквизитов = Новый Массив;
	
	СоответствиеКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	Для Каждого ТекущееЗначение Из СоответствиеКонвертируемыхРеквизитов Цикл
		ИменаРеквизитов.Добавить(ТекущееЗначение.Ключ);
	КонецЦикла;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1, ДокументОснование);
	
	СтруктураПредставлений = КонтурЛогистика_ОбработкаДокументовСервер.ВычислитьРеквизитыДокументаОснования(
		ИменаРеквизитов, ДокументТитулОбъект, КонтекстНастройкиКонвертации);
	
	Возврат СтруктураПредставлений;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()

	Перем МассивКонвертируемыхРеквизитов;

	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("ЛицоОформившееПЛ", "ЛицоОформившееПЛ");
	МассивКонвертируемыхРеквизитов.Вставить("ОрганизацияМедик", "ОрганизацияМедик");
	МассивКонвертируемыхРеквизитов.Вставить("ОрганизацияТехСостояние", "ОрганизацияТехСостояние");
	МассивКонвертируемыхРеквизитов.Вставить("ОрганизацияОдометр", "ОрганизацияОдометр");
	МассивКонвертируемыхРеквизитов.Вставить("Грузоотправитель", "Грузоотправитель");
	
	МассивКонвертируемыхРеквизитов.Вставить("Водитель", "Водитель");
	МассивКонвертируемыхРеквизитов.Вставить("Водитель2", "Водитель2");
	МассивКонвертируемыхРеквизитов.Вставить("ТранспортноеСредство", "ТранспортноеСредство");
	МассивКонвертируемыхРеквизитов.Вставить("Прицеп", "Прицеп");
	МассивКонвертируемыхРеквизитов.Вставить("Прицеп2", "Прицеп2");
	МассивКонвертируемыхРеквизитов.Вставить("МестоОтправления", "МестоОтправления");
	
	Возврат МассивКонвертируемыхРеквизитов;

КонецФункции

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)

	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);

	Если ЗначениеЗаполнено(ЗначениеОбъектДокУчСист) Тогда

		ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);

	Иначе
		
		// открыть документ
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Объект.ДокументОснование);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)

	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);

	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);

	Если Элемент.Имя = "ДокУчСист_Грузоотправитель_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_ОрганизацияОдометр_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_ОрганизацияТехСостояние_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_ОрганизацияМедик_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_ЛицоОформившееПЛ_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";

	ИначеЕсли Элемент.Имя = "ДокУчСист_МестоПогрузки_Сопоставить" 
		Или Элемент.Имя = "ДокУчСист_МестоДоставки_Сопоставить" 
		Или Элемент.Имя = "ДокУчСист_МестоОтправления_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ПунктыМаршрута";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ТранспортноеСредство_Сопоставить" 
		Или Элемент.Имя = "ДокУчСист_Прицеп_Сопоставить"
		Или Элемент.Имя = "ДокУчСист_Прицеп2_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ТранспортныеСредства";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ПогрузкаСотрудник_Сопоставить" 
		Или Элемент.Имя = "ДокУчСист_Водитель_Сопоставить" 
		Или Элемент.Имя = "ДокУчСист_Водитель2_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_Сотрудники";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ЭкспедицияДоговор_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_Договоры";

	Иначе

		ВызватьИсключение "не реализовано";

	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
																   ПараметрыФормыПоиска,
																   ЭтаФорма,
																   ЭтаФорма,
																   "ОбработчикВыбораСопоставленияРеквизитаДокумента",
																   ПараметрыОбработчика);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание
		ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);

		ПолностьюОбновитьПредставлениеДанных();

		ОбновитьДанныеФормы();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)

	ДокОбъект = РеквизитФормыВЗначение("Объект");


	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	ДанныеЗаполнения = Новый Структура("ДокументОснование, ТипЛогистика",
									   Объект.ДокументОснование,
									   Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1);
	ДокОбъект.Заполнить(ДанныеЗаполнения);

	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

КонецПроцедуры


&НаКлиенте
Процедура СвязанныеДокументыТитулыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекКолонка = Поле;
		ИмяКолонки = ТекКолонка.Имя;
		
		Если ИмяКолонки = "СвязиТитуловТитул" Тогда 
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
			ТекущиеДанные.Титул);
			
		ИначеЕсли ИмяКолонки = "СвязиТитуловДокументОснование" Тогда 
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
			ТекущиеДанные.ДокументОснование);
			
		ИначеЕсли ИмяКолонки = "СвязиТитуловФайл" Тогда 
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
			ТекущиеДанные.Файл);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеВодителиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеВодителиПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ИнфПолПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ИнфПолПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбязМедосмотрПослеПриИзменении(Элемент)
	УправлениеКолбасойТитуловВызовСервера();
КонецПроцедуры


&НаКлиенте
Процедура Декорация4Нажатие(Элемент)
	Элементы.ГруппаДопСтороны.Видимость = Истина;
	Элементы.ГруппаВключитьВидимостьСторон.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КартинкаВодительПлюс1Нажатие(Элемент)
	Элементы.КартинкаВодительПлюс1.Видимость = Ложь;
	Элементы.ГруппаВодитель2.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПрицепПлюс1Нажатие(Элемент)
	Элементы.КартинкаПрицепПлюс1.Видимость = Ложь;
	Элементы.ГруппаПрицеп2.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтоСменаВодителя1Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект.ЭтоСменаВодителя = Не Объект.ЭтоСменаВодителя;
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДопПоля(Команда)
	
	Элементы.Страницы.Видимость = Не Элементы.Страницы.Видимость;
	Если Элементы.Страницы.Видимость Тогда 
		КомандаЗаголовок = "Скрыть доп. реквизиты";
	Иначе
		КомандаЗаголовок = "Показать доп. реквизиты";		
	КонецЕсли;
	Элементы.ПоказатьДопПоля.Заголовок = КомандаЗаголовок;
	
	ДополнитьЗаголовокПоказатьДопПоля();
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьЗаголовокПоказатьДопПоля()
	
	массивГосСист = Новый Массив;
	массивГосСист.Добавить("ЕГАИС");
	массивГосСист.Добавить("ВетИС");
	массивГосСист.Добавить("ГИС МТ");
	
	тзИдентификаторыГосСист = Новый ТаблицаЗначений;
	тзИдентификаторыГосСист.Колонки.Добавить("ГосСист");
	тзИдентификаторыГосСист.Колонки.Добавить("Номер");
	тзИдентификаторыГосСист.Колонки.Добавить("Колво");
	
	КраткоеОписание = "";
		
	Для каждого ГосСист Из массивГосСист Цикл
	
		Отбор = Новый Структура;
		Отбор.Вставить("Идентиф",ГосСист);
		
		Строки = Объект.ИнфПол.НайтиСтроки(Отбор);
		
		Если Строки.Количество() = 0 Тогда
			
		ИначеЕсли Строки.Количество() = 1 Тогда
			
			НоваяСтрока = тзИдентификаторыГосСист.Добавить();
			НоваяСтрока.ГосСист = ГосСист;
			НоваяСтрока.Номер = Строки[0].Значение;
			НоваяСтрока.Колво = 1;
			
		Иначе
			НоваяСтрока = тзИдентификаторыГосСист.Добавить();
			НоваяСтрока.ГосСист = ГосСист;
			НоваяСтрока.Колво = Строка(Строки.Количество());
		КонецЕсли;
		
	КонецЦикла;
	
	Если тзИдентификаторыГосСист.Количество() = 1 И тзИдентификаторыГосСист[0].Колво = 1 Тогда
		КраткоеОписание = тзИдентификаторыГосСист[0].ГосСист + " " + тзИдентификаторыГосСист[0].Номер;	
	Иначе
	
		Для каждого Стр Из тзИдентификаторыГосСист Цикл
			КраткоеОписание = ?(ЗначениеЗаполнено(КраткоеОписание), КраткоеОписание + "; " + Стр.ГосСист + " " + Стр.Колво + " шт.", КраткоеОписание + Стр.ГосСист + " " + Стр.Колво + " шт.");	
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КраткоеОписание) Тогда
		Элементы.ПоказатьДопПоля.Заголовок =  ?(Элементы.Страницы.Видимость, "Скрыть доп. реквизиты", "Показать доп. реквизиты" + " (" + КраткоеОписание + ")");
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИнтервалВыклНажатие(Элемент)
	Элементы.СрокПЛИнтервал.Видимость = Истина;
	Элементы.ГруппаСрокИнтервал.Видимость = Ложь;
	
	Элементы.СрокПЛ.Заголовок = "С";
КонецПроцедуры

#Область СквознойСценарий

&НаКлиенте
Процедура ОбновитьЭлементыСквозногоСценария()
	
	Элементы.ГруппаСквознойСценарий.Видимость = Не Объект.ЭтоСменаВодителя;
	
	// Медосмотр
	СтороннийМедик = СтороннийМедик();
	Элементы.ГруппаСквознойСценарийМедик.Доступность = Не СтороннийМедик;
	
	Элементы.ФормироватьТ2СразуФлажекВыкл.Видимость = Не Объект.ФормироватьТ2Сразу;
	Элементы.ФормироватьТ2СразуФлажекВкл.Видимость = Объект.ФормироватьТ2Сразу;
	Элементы.ГруппаСквознойСценарийМедикДанные.Видимость = Объект.ФормироватьТ2Сразу;
	
	// Тех контроль и показания одометра
	СтороннийТехКонтроль = СтороннийТехКонтроль();
	СтороннийПоказанияОдометра = СтороннийПоказанияОдометра();
	Элементы.ГруппаСквознойСценарийТехКонтроль.Доступность = Не СтороннийТехКонтроль И Не СтороннийПоказанияОдометра;
	
	Элементы.ФормироватьТ3СразуФлажекВыкл.Видимость = Не Объект.ФормироватьТ3Сразу;
	Элементы.ФормироватьТ3СразуФлажекВкл.Видимость = Объект.ФормироватьТ3Сразу;
	Элементы.ФормироватьТ4СразуФлажекВыкл.Видимость = Не Объект.ФормироватьТ4Сразу;
	Элементы.ФормироватьТ4СразуФлажекВкл.Видимость = Объект.ФормироватьТ4Сразу;
	Элементы.ГруппаСквознойСценарийТехКонтрольДанные.Видимость = Объект.ФормироватьТ3Сразу;
	Элементы.ГруппаСквознойСценарийПоказанияОдометраДанные.Видимость = Объект.ФормироватьТ4Сразу;
			
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьТ2СразуФлажекВклВыклНажатие(Элемент)
	
	Модифицированность = Истина;
	
	Объект.ФормироватьТ2Сразу = Не Объект.ФормироватьТ2Сразу;
	
	ОбновитьЭлементыСквозногоСценария();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьТ3СразуФлажекВклВыклНажатие(Элемент)
	
	Модифицированность = Истина;
	
	Объект.ФормироватьТ3Сразу = Не Объект.ФормироватьТ3Сразу;
	
	Если Не Объект.ФормироватьТ3Сразу И Объект.ФормироватьТ4Сразу Тогда
		Объект.ФормироватьТ4Сразу = Ложь;
	КонецЕсли;
		
	ОбновитьЭлементыСквозногоСценария();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьТ4СразуФлажекВклВыклНажатие(Элемент)
	
	Модифицированность = Истина;
	
	Объект.ФормироватьТ4Сразу = Не Объект.ФормироватьТ4Сразу;
	
	Если Не Объект.ФормироватьТ3Сразу И Объект.ФормироватьТ4Сразу Тогда
		Объект.ФормироватьТ3Сразу = Истина;
	КонецЕсли;
	
	ОбновитьЭлементыСквозногоСценария();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Функция СтороннийМедик()
	
	Возврат (ЗначениеЗаполнено(Объект.ОрганизацияМедик)
		И Объект.ЛицоОформившееПЛ <> Объект.ОрганизацияМедик
		И Не ОрганизацияМедикНаш);
	
	КонецФункции
	
&НаСервере
Функция СтороннийМедикСервер()
	
	Возврат (ЗначениеЗаполнено(Объект.ОрганизацияМедик)
		И Объект.ЛицоОформившееПЛ <> Объект.ОрганизацияМедик
		И Не ОрганизацияМедикНаш);
	
КонецФункции

&НаКлиенте
Функция СтороннийТехКонтроль()
	
	Возврат (ЗначениеЗаполнено(Объект.ОрганизацияТехСостояние)
		И Объект.ЛицоОформившееПЛ <> Объект.ОрганизацияТехСостояние
		И Не ОрганизацияТехСостояниеНаш);
	
КонецФункции

&НаКлиенте
Функция СтороннийПоказанияОдометра()
	
	Возврат (ЗначениеЗаполнено(Объект.ОрганизацияОдометр)
		И Объект.ЛицоОформившееПЛ <> Объект.ОрганизацияОдометр
		И Не ОрганизацияОдометрНаш);
	
КонецФункции

&НаКлиенте
Процедура ДанныеТ2ПользовательПодписантНастройкаНажатие(Элемент)
	
	Элементы.ДанныеТ2ПараметрНастроекПодписания.Видимость = Не Элементы.ДанныеТ2ПараметрНастроекПодписания.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ3ПользовательПодписантНастройкаНажатие(Элемент)
	
	Элементы.ДанныеТ3ПараметрНастроекПодписания.Видимость = Не Элементы.ДанныеТ3ПараметрНастроекПодписания.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ4ПользовательПодписантНастройкаНажатие(Элемент)
	
	Элементы.ДанныеТ4ПараметрНастроекПодписания.Видимость = Не Элементы.ДанныеТ4ПараметрНастроекПодписания.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяТекущим(Команда)
	
	Если ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТекущегоЭлемента = ТекущийЭлемент.Имя;
	
	Если ИмяТекущегоЭлемента = "УстановитьДатуВремяТекущимТ2" Тогда
		Объект.ДанныеТ2ДатВрПрМО = ТекущаяДатаСервера();
	ИначеЕсли ИмяТекущегоЭлемента = "УстановитьДатуВремяТекущимТ31" Тогда
		Объект.ДанныеТ3ДатВрКонтТехСост = ТекущаяДатаСервера();
	ИначеЕсли ИмяТекущегоЭлемента = "УстановитьДатуВремяТекущимТ32" Тогда
		Объект.ДанныеТ3ДатВрВыпНаЛин = ТекущаяДатаСервера();
	ИначеЕсли ИмяТекущегоЭлемента = "УстановитьДатуВремяТекущимТ4" Тогда
		Объект.ДанныеТ4ДатВрОдометр = ТекущаяДатаСервера();
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ2МедРаботникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДанныеТ2МедРаботник) Тогда
		
		МедЛицензияМедРаботника = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.ДанныеТ2МедРаботник, "МедЛицензия");
		
		Если ЗначениеЗаполнено(МедЛицензияМедРаботника) Тогда
			Объект.ДанныеТ2МедЛицензия = МедЛицензияМедРаботника;
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ТекущаяДатаСервера()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаСервереБезКонтекста
Функция ТребуетсяПереотправить(КодСостоянияДокументооборота)
	
	Возврат (КодСостоянияДокументооборота = "pl-rejected-cheсkup" Или КодСостоянияДокументооборота = "pl-rejected-techInspection");
	
КонецФункции

&НаСервереБезКонтекста
Функция Переотправлен(КодСостоянияДокументооборота)
	
	Возврат (КодСостоянияДокументооборота = "forwarded");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПричинаОтказаВПодписиТехКонтроляИзТитула3(Титул1)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Титул1", Титул1);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул3.ПричинаОтказаВПодписи КАК ПричинаОтказаВПодписи
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул3 КАК КонтурЛогистика_ПЛ_Титул3
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул3.Титул1 = &Титул1
	|	И КонтурЛогистика_ПЛ_Титул3.ЕстьОтказВПодписи
	|	И НЕ КонтурЛогистика_ПЛ_Титул3.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПричинаОтказаВПодписи;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура ДанныеТ2МедЛицензияПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ2ДатВрПрМОПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ2ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ3ТехРаботникПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ3ДатВрКонтТехСостПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ3ДатВрВыпНаЛинПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ3ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ4ОдометрРаботникПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ4ПоказанияОдометраПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ4ДатВрОдометрПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТ4ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиВидВладенияТС()
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) И ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ) Тогда
		
		АрендодательЛизингодатель = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.ТранспортноеСредство, "АрендодательЛизингодатель");
		
		Если Объект.ЛицоОформившееПЛ = АрендодательЛизингодатель Или Не ЗначениеЗаполнено(АрендодательЛизингодатель) Тогда
			Элементы.ДокУчСист_ТранспортноеСредство_ВидВладения.Заголовок = "в собственности";			
		Иначе			
			Элементы.ДокУчСист_ТранспортноеСредство_ВидВладения.Заголовок = "в аренде";			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПерезаполнитьДокументыОснования(
		Объект.ДокументыОснования, Объект.ДокументОснование);
		
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда 	
		Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик")
			Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка") Тогда 
			ПерезаполнитьПоДокОснованию(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПерезаполнитьДокументыОснования(
		Объект.ДокументыОснования, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ИзменениеДокумнетовОснований();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПослеУдаления(Элемент)
	
	ИзменениеДокумнетовОснований();
	
	// Проверим, что удаленный документ основания не используется для заполнения
	ЕстьДокументЗаполнения = Ложь;
	Для Каждого ТекущаяСтрока Из Объект.ДокументыОснования Цикл
		Если ТекущаяСтрока.ДокументОснование = Объект.ДокументОснование Тогда
			ЕстьДокументЗаполнения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьДокументЗаполнения Тогда
		Если Объект.ДокументыОснования.Количество() > 0 Тогда
			// Возьмем первый из списка
			Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
			ПоказатьПредупреждениеПерезаполнения();
		Иначе
			Объект.ДокументОснование = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДокумнетовОснований()
	ОтрисоватьДокументыОснованияКлиент();
	Элементы.ПерезаполнитьПоДокОснованию.ЦветТекста = WebЦвета.Красный;
КонецПроцедуры

&НаСервере
Процедура ОтрисоватьДокументыОснованияСервер()
	
	КоличествоОснований = Объект.ДокументыОснования.Количество();
	Если КоличествоОснований > 1 Тогда 
		Элементы.ДекорацияНесколькоОснований.Видимость = Истина;
		Элементы.ДокументОснование.Видимость = Ложь;
		Элементы.ДекорацияНесколькоОснований.Заголовок = "" + КоличествоОснований + " документов-оснований";
	Иначе
		Элементы.ДекорацияНесколькоОснований.Видимость = Ложь;
		Элементы.ДокументОснование.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтрисоватьДокументыОснованияКлиент()
	
	КоличествоОснований = Объект.ДокументыОснования.Количество();
	Если КоличествоОснований > 1 Тогда 
		Элементы.ДекорацияНесколькоОснований.Видимость = Истина;
		Элементы.ДокументОснование.Видимость = Ложь;
		Элементы.ДекорацияНесколькоОснований.Заголовок = "" + КоличествоОснований + " документов-оснований";
	Иначе
		Элементы.ДекорацияНесколькоОснований.Видимость = Ложь;
		Элементы.ДокументОснование.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументовОснования(Команда)
	
	ИмяФормыДокумента = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ИмяФормыДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ИмяФормыВыбораПоТипуДокумента(ТипЗнч(Объект.ДокументОснование));
	КонецЕсли;
	
	Если ИмяФормыДокумента = Неопределено Тогда
		
		// Открываем форму выбора типа документа
		ТипыДокументаОснования = КонтурЛогистика_ОбщегоНазначенияСервер.ТипыДокументаОснования("КонтурЛогистика_ПЛ_Титул1");
		
		Если ТипыДокументаОснования = Неопределено Тогда
			Сообщить("Не удалось определить тип документа основания!");
			Возврат;
		КонецЕсли;
		
		СЗТипыДокументаОснования = Новый СписокЗначений;
		СЗТипыДокументаОснования.ЗагрузитьЗначения(ТипыДокументаОснования);
		
		Оповещение = Новый ОписаниеОповещения("ВыборТипаДокументаОснованияЗавершение", ЭтаФорма);
		
		СЗТипыДокументаОснования.ПоказатьВыборЭлемента(Оповещение);
		
	Иначе
		
		// Сразу открываем форму выбора
		ОткрытьФормуВыбораДокументаОснование(ИмяФормыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаДокументаОснованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ИмяФормыВыбораПоТипуДокумента(Результат.Значение);
	
	ОткрытьФормуВыбораДокументаОснование(ИмяФормыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораДокументаОснование(ИмяФормыДокумента)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Ложь);
	
	Если ТипЗнч(ПолучитьФорму(ИмяФормыДокумента)) = Тип("УправляемаяФорма") Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы(ИмяФормыДокумента, ПараметрыФормы, Элементы.ДокументыОснования);
	Иначе
		ОткрытьФорму(ИмяФормыДокумента, ПараметрыФормы, Элементы.ДокументыОснования);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновнымДокументомОснования(Команда)
	
	ТекущиеДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДокументОснование = ТекущиеДанные.ДокументОснование;
	
	ИзменениеДокумнетовОснований();
	
	УстановитьПервой(Объект.ДокументыОснования.Индекс(ТекущиеДанные), ТекущиеДанные.НомерСтроки);
	
	ПоказатьПредупреждениеПерезаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеПерезаполнения()
	
	ТекстПредупреждения = "Документ используемый для заполнения изменен.
		|Возможно следует перезаполнить документ.";
	КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПервой(Знач ИндексСтроки, Знач НомерСтроки)
	
	Объект.ДокументыОснования.Сдвинуть(ИндексСтроки, 1 - НомерСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		ОбработатьВыборДокументовОснования(ВыбранноеЗначение);
		
	Иначе
		
		массДокументыОснования = Новый Массив;
		массДокументыОснования.Добавить(ВыбранноеЗначение);
		
		ОбработатьВыборДокументовОснования(массДокументыОснования);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументовОснования(массДокументыОснования)
	
	Если массДокументыОснования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущееЗначение Из массДокументыОснования Цикл
		
		ЕстьДубли = Ложь;
		
		Для Каждого ТекущийДокументОснования Из Объект.ДокументыОснования Цикл
			Если ТекущийДокументОснования.ДокументОснование = ТекущееЗначение Тогда
				ЕстьДубли = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДубли Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ТекущееЗначение;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.ДокументыОснования.Количество() <> 0 Тогда
		Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
		ПоказатьПредупреждениеПерезаполнения();
	КонецЕсли;
	
	ИзменениеДокумнетовОснований();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделительИндикаторПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНесколькоОснованийНажатие(Элемент)
	ЭтаФорма.ТекущийЭлемент = Элементы.ДокументыОснования;
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции
